load_testing/.results/20250116/233210/basic_request.txt
Test Case: basic_request

Description: Simulates a basic request to the application without any specific operations.
Rationale: Establishes a baseline for system response under minimal load.
Probability: Low (5-10% of interactions, mostly for system checks)

URL: https://otto-dev.cloud.justice.gc.ca//load_test/

Date: 2025-01-16
Time: 23:36:12

Application GitHub Hash: f2de21676fc2c833038e21b5d3233ae8c222354e
Infrastructure GitHub Hash: 6df25a184cb077fe3b8219cad3650a733d9ea5d1

----------------------------------------------------------
Scenario: constant_load
Options: {
  "executor": "constant-vus",
  "vus": 50,
  "duration": "2m",
  "startTime": "0s"
}

Results:
     ✓ status is 200

     checks.........................: 100.00% ✓ 7930      ✗ 0    
     data_received..................: 125 MB  520 kB/s
     data_sent......................: 1.5 MB  6.0 kB/s
     http_req_blocked...............: avg=11.86ms  min=120ns   med=782ns    max=3.3s     p(90)=1.32µs   p(95)=1.59µs  
     http_req_connecting............: avg=714.41µs min=0s      med=0s       max=477.91ms p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=94.57ms  min=40.47ms med=101.03ms max=771.28ms p(90)=137.63ms p(95)=150.28ms
       { expected_response:true }...: avg=94.57ms  min=40.47ms med=101.03ms max=771.28ms p(90)=137.63ms p(95)=150.28ms
     http_req_failed................: 0.00%   ✓ 0         ✗ 15860
     http_req_receiving.............: avg=25.53ms  min=23.24µs med=1.26ms   max=351.43ms p(90)=53.8ms   p(95)=56.72ms 
     http_req_sending...............: avg=149.04µs min=24.51µs med=132.59µs max=1.73ms   p(90)=236.89µs p(95)=281.95µs
     http_req_tls_handshaking.......: avg=10.8ms   min=0s      med=0s       max=3.16s    p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=68.88ms  min=40.03ms med=62.15ms  max=720.41ms p(90)=85.99ms  p(95)=97.16ms 
     http_reqs......................: 15860   65.757997/s
     iteration_duration.............: avg=1.21s    min=1.12s   med=1.18s    max=4.79s    p(90)=1.21s    p(95)=1.25s   
     iterations.....................: 7930    32.878999/s
     vus............................: 13      min=0       max=99 
     vus_max........................: 100     min=100     max=100

----------------------------------------------------------
Scenario: ramp_up
Options: {
  "executor": "ramping-vus",
  "startVUs": 0,
  "stages": [
    {
      "duration": "1m",
      "target": 10
    },
    {
      "duration": "1m",
      "target": 100
    }
  ],
  "startTime": "2m"
}

Results:
     ✓ status is 200

     checks.........................: 100.00% ✓ 7930      ✗ 0    
     data_received..................: 125 MB  520 kB/s
     data_sent......................: 1.5 MB  6.0 kB/s
     http_req_blocked...............: avg=11.86ms  min=120ns   med=782ns    max=3.3s     p(90)=1.32µs   p(95)=1.59µs  
     http_req_connecting............: avg=714.41µs min=0s      med=0s       max=477.91ms p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=94.57ms  min=40.47ms med=101.03ms max=771.28ms p(90)=137.63ms p(95)=150.28ms
       { expected_response:true }...: avg=94.57ms  min=40.47ms med=101.03ms max=771.28ms p(90)=137.63ms p(95)=150.28ms
     http_req_failed................: 0.00%   ✓ 0         ✗ 15860
     http_req_receiving.............: avg=25.53ms  min=23.24µs med=1.26ms   max=351.43ms p(90)=53.8ms   p(95)=56.72ms 
     http_req_sending...............: avg=149.04µs min=24.51µs med=132.59µs max=1.73ms   p(90)=236.89µs p(95)=281.95µs
     http_req_tls_handshaking.......: avg=10.8ms   min=0s      med=0s       max=3.16s    p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=68.88ms  min=40.03ms med=62.15ms  max=720.41ms p(90)=85.99ms  p(95)=97.16ms 
     http_reqs......................: 15860   65.757997/s
     iteration_duration.............: avg=1.21s    min=1.12s   med=1.18s    max=4.79s    p(90)=1.21s    p(95)=1.25s   
     iterations.....................: 7930    32.878999/s
     vus............................: 13      min=0       max=99 
     vus_max........................: 100     min=100     max=100