load_testing/.results/20250116/233210/user_library_permissions.txt
Test Case: user_library_permissions

Description: Tests user library permission checks, simulating access control operations.
Rationale: Ensures the system can handle frequent permission checks without degradation.
Probability: High (70-80% of user sessions will involve permission checks)

URL: https://otto-dev.cloud.justice.gc.ca//load_test/?user_library_permissions

Date: 2025-01-16
Time: 23:42:14

Application GitHub Hash: f2de21676fc2c833038e21b5d3233ae8c222354e
Infrastructure GitHub Hash: 6df25a184cb077fe3b8219cad3650a733d9ea5d1

----------------------------------------------------------
Scenario: constant_load
Options: {
  "executor": "constant-vus",
  "vus": 75,
  "duration": "3m",
  "startTime": "0s"
}

Results:
     ✓ status is 200

     checks.........................: 100.00% ✓ 17872     ✗ 0    
     data_received..................: 282 MB  781 kB/s
     data_sent......................: 3.2 MB  9.0 kB/s
     http_req_blocked...............: avg=1.46ms   min=110ns   med=741ns    max=3.14s    p(90)=1.26µs   p(95)=1.51µs  
     http_req_connecting............: avg=496.38µs min=0s      med=0s       max=145.21ms p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=114.22ms min=40.24ms med=106.95ms max=1.87s    p(90)=178.94ms p(95)=229.21ms
       { expected_response:true }...: avg=114.22ms min=40.24ms med=106.95ms max=1.87s    p(90)=178.94ms p(95)=229.21ms
     http_req_failed................: 0.00%   ✓ 0         ✗ 35744
     http_req_receiving.............: avg=27.46ms  min=22.11µs med=1.24ms   max=1.5s     p(90)=56.1ms   p(95)=63.68ms 
     http_req_sending...............: avg=203.77µs min=23.76µs med=123.46µs max=531.18ms p(90)=224.5µs  p(95)=269.05µs
     http_req_tls_handshaking.......: avg=885.39µs min=0s      med=0s       max=3.06s    p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=86.56ms  min=40.07ms med=67.4ms   max=1.82s    p(90)=126.28ms p(95)=172.39ms
     http_reqs......................: 35744   98.968234/s
     iteration_duration.............: avg=1.23s    min=1.14s   med=1.19s    max=4.33s    p(90)=1.3s     p(95)=1.4s    
     iterations.....................: 17872   49.484117/s
     vus............................: 33      min=0       max=149
     vus_max........................: 150     min=150     max=150

----------------------------------------------------------
Scenario: ramp_up
Options: {
  "executor": "ramping-vus",
  "startVUs": 0,
  "stages": [
    {
      "duration": "1m30s",
      "target": 20
    },
    {
      "duration": "1m30s",
      "target": 150
    }
  ],
  "startTime": "3m"
}

Results:
     ✓ status is 200

     checks.........................: 100.00% ✓ 17872     ✗ 0    
     data_received..................: 282 MB  781 kB/s
     data_sent......................: 3.2 MB  9.0 kB/s
     http_req_blocked...............: avg=1.46ms   min=110ns   med=741ns    max=3.14s    p(90)=1.26µs   p(95)=1.51µs  
     http_req_connecting............: avg=496.38µs min=0s      med=0s       max=145.21ms p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=114.22ms min=40.24ms med=106.95ms max=1.87s    p(90)=178.94ms p(95)=229.21ms
       { expected_response:true }...: avg=114.22ms min=40.24ms med=106.95ms max=1.87s    p(90)=178.94ms p(95)=229.21ms
     http_req_failed................: 0.00%   ✓ 0         ✗ 35744
     http_req_receiving.............: avg=27.46ms  min=22.11µs med=1.24ms   max=1.5s     p(90)=56.1ms   p(95)=63.68ms 
     http_req_sending...............: avg=203.77µs min=23.76µs med=123.46µs max=531.18ms p(90)=224.5µs  p(95)=269.05µs
     http_req_tls_handshaking.......: avg=885.39µs min=0s      med=0s       max=3.06s    p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=86.56ms  min=40.07ms med=67.4ms   max=1.82s    p(90)=126.28ms p(95)=172.39ms
     http_reqs......................: 35744   98.968234/s
     iteration_duration.............: avg=1.23s    min=1.14s   med=1.19s    max=4.33s    p(90)=1.3s     p(95)=1.4s    
     iterations.....................: 17872   49.484117/s
     vus............................: 33      min=0       max=149
     vus_max........................: 150     min=150     max=150